# Напишите программу, которая принимает строку и выводит её в верхнем и нижнем регистре.

input_string = input()

print(f"Верхний регистр: {input_string.upper()}")

print(f"Нижний регистр: {input_string.lower()}")
