# Напишите программу которая получает от пользователя число и возвращает
# корень из этого числа, используйте модуль math

from math import sqrt

value = float(input())

print(sqrt(value))