# Напишите программу, которая получает от пользователя вещественных 2 числа и выводит их сумму, произведение,
# целую часть от деления и остаток от деления. Каждый вывод с новой строки.

# ввод
num1 = float(input("Введите вещественное число 1 > "))
num2 = float(input("Введите вещественное число 2 > "))

# вычисления
sum_num = num1 + num2
mult_num = num1 * num2
div_num = num1 // num2
mod_num = num1 % num2

# вывод
print(f"Сумма: {sum_num}\n"
      f"Произведение: {mult_num}\n"
      f"Целая часть от деления: {div_num}\n"
      f"Остаток от деления {mod_num}\n")



# Запрос ввода числа от пользователя
number1 = float(input("Введите вещественное число 1 > "))
number2 = float(input("Введите вещественное число 2 > "))

# Рассчет результата
summ = ...
multiply = ...
div = ...
mod = ...

# Вывод результата
print(...)
...
print(...)

